src/test/resources/fixtures/paymentCallback.json

{"callback_time":"2019-07-01T09:30:06.828Z","payment_method":"BANKCARD","merchant_order":{"id":"67897"},"customer":{"email":"customer@gmail.com","id":"3439100","ip":"1.1.1.1","locale":"en"},"payment_data":{"id":"276122317","status":"COMPLETED","amount":6.03,"currency":"USD","created":"2019-07-01T09:29:57.409901Z","note":"Note","rrn":"000012725137","auth_code":"114564","is_3d":false},"card_account":{"masked_pan":"412345...1234","issuing_country_code":"US","holder":"John Smith"}}