src/test/resources/fixtures/refundCallback.json

{"callback_time":"2019-07-01T11:15:19.140Z","payment_method":"BANKCARD","merchant_order":{"id":"770183:10527453:018"},"customer":{"email":"customer@gmail.com","id":"770223:1053:0"},"refund_data":{"id":"2761801","status":"COMPLETED","amount":34.43,"currency":"USD","created":"2019-07-01T09:33:21Z","note":"Note","rrn":"000071231945","auth_code":"7413455","is_3d":false},"payment_data":{"id":"2612369","remaining_amount":165.57},"card_account":{"masked_pan":"412345...1234","issuing_country_code":"US"}}